Repository: mkappus1/DatenmanagementMTHS24
Catalog: Woche 2/Skripte/TMX-EN-DE/tmx_teil_4.tmx
Source language: de
Languages: en

source: Entkoffeinierter Kaffee
en: Decaffeinated coffee

source: Lakritzenstangen [Süßwaren]
en: Stick liquorice [confectionery]

source: Riegel auf Weizenbasis
en: Bars based on wheat

source: Gefüllte Baguettes
en: Filled baguettes

source: Nicht medizinische Süßwaren mit Minzgeschmack
en: Mint flavoured confectionery (Non-medicated -)

source: Pfefferminzbonbons, nicht medizinisch
en: Mint flavoured sweets (Non-medicated -)

source: Gefülltes Brot
en: Filled bread rolls

source: Brot und Brötchen
en: Bread and buns

source: Süßwaren [nicht medizinisch]
en: Non-medicated confectionery candy

source: Nicht medizinische Süßwaren mit Milch
en: Non-medicated confectionery containing milk

source: Suppenwürzmittel [ausgenommen ätherische Öle]
en: Flavourings for soups [other than essential oils]

source: Nahrungsmittel aus Teig
en: Foodstuffs made from dough

source: Meerrettich [Würzmittel]
en: Horseradish [relishes]

source: Handgemachte Bonbons
en: Hand made candies

source: Feinbackwaren, gefüllt mit Obst
en: Fruit filled pastry products

source: Zichorie [Kaffee-Ersatz]
en: Chicory [coffee substitute]

source: Heiße Würstchen und Ketchup in aufgeschnittenen Brötchen
en: Hot sausage and ketchup in cut open bread rolls

source: Eisgetränke auf Kakaobasis
en: Ice beverages with a cocoa base

source: Schokoladenborke mit gemahlenen Kaffeebohnen
en: Chocolate bark containing ground coffee beans

source: Gefrorene Teigblätter
en: Frozen pastry sheets

source: Mischungen zur Herstellung von Eiskonfekt
en: Mixtures for making ice cream confections

source: Teige zur Herstellung von Crêpes
en: Batter for making pancakes

source: Grütze für Nahrungszwecke
en: Groats for human food

source: Gefüllte Schokolade
en: Filled chocolate

source: Torten [süß oder herzhaft]
en: Tarts [sweet or savoury]

source: Schokoladenbonbons mit Pralinengeschmack
en: Chocolate confectionery having a praline flavour

source: Chips aus Getreide
en: Crisps made of cereals

source: Glukosesirup zur Verwendung bei der Herstellung von Speisen
en: Glucose syrup for use in the manufacture of foods

source: Klößchen mit Shrimps
en: Shrimp dumplings

source: Zuckerlose Kaugummi
en: Sugar-free chewing gum

source: Süßwaren mit flüssigen Schnapsfüllungen
en: Confectionery having liquid spirit fillings

source: Süßwaren mit Weinfüllungen
en: Confectionery having wine fillings

source: Schokoladenessenzen für die Zubereitung von Getränken
en: Chocolate extracts for the preparation of beverages

source: Stärke für diätetische Zwecke [ausgenommen pharmazeutische Erzeugnisse]
en: Starches for dietetic purposes [other than pharmaceutical]

source: Zimtpulver [Gewürz]
en: Cinnamon powder [spice]

source: Aromapräparate für Bonbons
en: Aromatic preparations for candies

source: Tiefgefrorener, zubereiteter Reis mit Gewürzen und Gemüse
en: Frozen prepared rice with seasonings and vegetables

source: Dessertmousses [Süßwaren]
en: Dessert mousses [confectionery]

source: Süßwarenchips aus Erdnussbutter
en: Peanut butter confectionery chips

source: Konservierte Pizzen
en: Preserved pizzas

source: Vanille
en: Vanilla

source: Puddingdesserts auf Reisbasis
en: Rice-based pudding dessert

source: Salz
en: Salt

source: Frühstückszerealien mit Honiggeschmack
en: Breakfast cereals flavoured with honey

source: Tafelsalz gemischt mit Sesamsamen
en: Table salt mixed with sesame seeds

source: Mit Süßstoffen gesüßter teeinfreier Tee
en: Theine-free tea sweetened with sweeteners

source: Ungesäuertes Brot in dünnen Scheiben
en: Unleavened bread in thin sheets

source: Vollkornbrot
en: Wholemeal bread

source: Reis, Tapioka
en: Rice tapioca

source: Fertiggerichte, die vorwiegend Teigwaren enthalten
en: Prepared meals containing [principally] pasta

source: Algen [Würzstoff]
en: Seaweed [condiment]

source: Aromawürzstoffe für Suppen
en: Flavourings for soups

source: Mehle zur Zubereitung von Klößen aus Klebreis
en: Flour for making dumplings of glutinous rice

source: Zwiebel- oder Käsekleingebäck
en: Onion or cheese biscuits

source: Teighüllen für Gyoza
en: Pasta-wrappings for gyoza

source: Essbare Essenzen für Nahrungszwecke [ausgenommen ätherische Substanzen und ätherische Öle]
en: Edible essences for foodstuffs [other than etheric substances and essential oils]

source: Kakaoextrakte zur Verwendung als Geschmacksstoffe in Getränken
en: Extracts of cocoa for use as flavours in beverages

source: Gemüsekonzentrate zur Verwendung als Würzmittel
en: Vegetable concentrates used for seasoning

source: Vanillin [Vanille-Ersatz]
en: Vanillin [vanilla substitute]

source: Wiener Gebäck
en: Viennese pastries

source: Eiscremeerzeugnisse auf Sojabasis
en: Soya based ice cream products

source: Nicht medizinische Süßwaren mit Toffeefüllungen
en: Non-medicated confectionery having toffee fillings

source: Nicht medizinische Süßwaren in Eiform
en: Non-medicated confectionery in the shape of eggs

source: Nicht medizinische Mehlspeisen
en: Non-medicated flour confectionery

source: Zichorien und Zichorienmischungen, alle zur Verwendung als Kaffee-Ersatzmittel
en: Chicory and chicory mixtures, all for use as substitutes for coffee

source: Haferflocken und Weizen
en: Rolled oats and wheat

source: Tee [nicht medizinisch] mit Zitronenaroma
en: Teas (Non-medicated -) flavoured with lemon

source: Pralinen mit Marshmallowfüllung
en: Marshmallow filled chocolates

source: Imbissgerichte aus Zerealien mit Käsegeschmack
en: Cereal snack foods flavoured with cheese

source: Getreide für den menschlichen Verzehr
en: Cereals prepared for consumption by humans

source: Soßen für Hähnchen
en: Sauces for chicken

source: Eis am Stiel mit Milch
en: Ice lollies containing milk

source: Nicht medizinische gefrorene Süßwaren
en: Iced confectionery (Non-medicated -)

source: Koreanische Sojasoße [ganjang]
en: Korean soy sauce [ganjang]

source: Snackriegel auf Granola-Basis
en: Granola-based snack bars

source: Waffeln mit Schokoladenüberzug
en: Waffles with a chocolate coating

source: Schokoladengetränkzubereitungen mit Mokkageschmack
en: Chocolate drink preparations flavoured with mocha

source: Schokoladensirupe für die Zubereitung von Getränken auf Schokoladenbasis
en: Chocolate syrups for the preparation of chocolate based beverages

source: Buttergebäck mit Schokoladenüberzug
en: Shortbread with a chocolate coating

source: Snackriegel mit einer Mischung aus Getreidekörnern, Nüssen und getrocknetem Obst [Süßwaren]
en: Snack bars containing a mixture of grains, nuts and dried fruit [confectionery]

source: Süßsaure Saucen
en: Sweet and sour sauce

source: Süßes Gebäck für die menschliche Ernährung
en: Sweet biscuits for human consumption

source: Cracker mit Gemüsegeschmack
en: Crackers flavoured with vegetables

source: Cracker aus verarbeitetem Getreide
en: Crackers made of prepared cereals

source: Zichorienextrakte zur Verwendung als Kaffeeersatzmittel
en: Chicory extracts for use as substitutes for coffee

source: Gefrorene Pizzas
en: Chilled pizzas

source: Dänische Butterkekse
en: Danish butter cookies

source: Teigwaren in Form von Blättern
en: Pasta in the form of sheets

source: Eiscreme mit Schokoladengeschmack
en: Ice creams flavoured with chocolate

source: Aromawürzstoffe aus Essiggurken
en: Flavourings made from pickles

source: Nicht medizinisches Minzkonfekt
en: Non-medicated mint confectionery

source: Zucker
en: Sugar

source: Torten
en: Tarts

source: Schokolade
en: Chocolate

source: Teig
en: Dough

source: Verzehrfertige Desserts [Konditorwaren]
en: Prepared desserts [confectionery]

source: Karamell
en: Caramel

source: Zuckerguss
en: Frostings

source: Gebrannte Zuckerbonbons
en: Boiled sugar sweetmeats

source: Waffeln
en: Waffles

source: Pasteten [süß oder herzhaft]
en: Pies [sweet or savoury]

source: Relish [Würzmittel]
en: Relish [condiment]

source: Tee
en: Tea

source: Pfefferminz für Konfekt
en: Mint for confectionery

source: Pfefferminze für Konfekt
en: Peppermint for confectionery

source: Makkaroni
en: Macaroni

source: Lutschtabletten [Süßwaren]
en: Tablet (confectionary)

source: Brot
en: Bread

source: Frühstückscerealien, Haferbrei, Grütze
en: Breakfast cereals, porridge and grits

source: Hefe und Treibmittel
en: Yeast and leavening agents

source: Teig, Backteig und Backmischungen hierfür
en: Doughs, batters, and mixes therefor

source: Getrocknete und frische Teigwaren, Nudeln und Klöße
en: Dried and fresh pastas, noodles and dumplings

source: Süße Glasuren und Füllungen
en: Sweet glazes and fillings

source: Süßwaren [Bonbons], Schokoriegel und Kaugummi
en: Sweets (candy), candy bars and chewing gum

source: Müsliriegel und Energieriegel
en: Cereal bars and energy bars

source: Pikante Saucen, Chutneys und Pasten
en: Savory sauces, chutneys and pastes

source: Verarbeitetes Getreide und Stärken für Nahrungsmittel sowie Waren hieraus, Backzubereitungen und Hefe
en: Processed grains, starches, and goods made thereof, baking preparations and yeasts

source: Kaffee, Tee, Kakao und Ersatzstoffe hierfür
en: Coffee, teas and cocoa and substitutes therefor

source: Eis, Eiscreme, gefrorener Joghurt, Sorbets
en: Ice, ice creams, frozen yogurts and sorbets

source: Back- und Konditoreiwaren, Schokolade und Desserts
en: Baked goods, confectionery, chocolate and desserts

source: Fertiggerichte und pikante Snacks
en: Convenience food and savory snacks

source: Blüten oder Blätter als Teeersatz
en: Flowers or leaves for use as tea substitutes

source: Überwiegend aus Reis bestehende abgepackte Mittagsgerichte mit Fleisch, Fisch oder Gemüse
en: Pre-packaged lunches consisting primarily of rice, and also including meat, fish or vegetables

source: Buchweizengelee [Memilmuk]
en: Buckwheat jelly (Memilmuk)

source: Chrysanthementee [Gukhwacha]
en: Chrysanthemum tea (Gukhwacha)

source: Japanischer Biskuitkuchen [Kasutera]
en: Japanese sponge cakes (kasutera)

source: Rosmarin-Tee
en: Rosemary tea

source: Klebreiskuchen [Chapsalttock]
en: Sticky rice cakes (Chapsalttock)

source: Weißer Lotus-Tee [Baengnyeoncha]
en: White lotus tea (Baengnyeoncha)

source: Pikante Soßen [Würzmittel]
en: Savory sauces used as condiments

source: Schokolade mit japanischem Meerrettich
en: Chocolate with Japanese horseradish

source: Klettenwurzeltee [Wooungcha]
en: Burdock root tea (Wooungcha)

source: Sandwich-Wraps [Brot]
en: Sandwich wraps [bread]

source: Schokoladen-Brotaufstriche
en: Chocolate-based spreads

source: Onigiri [Reisbällchen]
en: Onigiri [rice balls]

source: Sesamkörner [Gewürz]
en: Sesame seeds [seasonings]

source: Riegel aus süßem geliertem Bohnenmus [Yohkan]
en: Bars of sweet jellied bean paste (Yohkan)

source: Fermentierter Malzreis [Koji]
en: Fermenting malted rice (Koji)

source: Arme Ritter
en: French toast

source: Ingwer-Tee
en: Ginger tea

source: Glutenfreies Brot
en: Gluten-free bread

source: Kuchen aus gestampftem Klebreis mit Bohnenpulver überzogen [Injeolmi]
en: Glutinous pounded rice cake coated with bean powder (injeolmi)

source: Kimchi-Pfannkuchen [Kimchijeon]
en: Kimchi pancakes (kimchijeon)

source: Koreanische Teigtaschen [Mandu]
en: Korean-style dumplings (mandu)

source: Salzarmes Brot
en: Low-salt bread

source: Mungobohnen-Pfannkuchen [Bindaetteok]
en: Mung bean pancakes (bindaetteok)

source: Kürbisbrei [Hobak juk]
en: Pumpkin porridge (Hobak-juk)

source: Rotes Pfefferpulver [Gochutgaru]
en: Red pepper powder (Gochutgaru)

source: Weiche Brezen
en: Soft pretzels

source: Kurz gebratene Nudeln mit Gemüse [Japchae]
en: Stir-fried noodles with vegetables (Japchae)

source: Süßkartoffelstärke für Speisezwecke
en: Sweet potato starch for food

source: Süßer Reis mit Nüssen und Jujuben [Yaksik]
en: Sweet rice with nuts and jujubes (yaksik)

source: Wan Tan-Chips
en: Wonton chips

source: Acanthopanax-Tee [Ogapicha]
en: Acanthopanax tea (Ogapicha)

source: Chinesischer Eheschließungsweintee [Gugijacha]
en: Chinese matrimony vine tea (Gugijacha)

source: Roter Ginsengtee
en: Red ginseng tea

source: Scharfe Sriracha-Chilisoße
en: Sriracha hot chili sauce

source: Hefeextrakte für die menschliche Ernährung
en: Yeast extracts for human consumption

source: Kaugummi
en: Bubble gum

source: Haferflocken
en: Oat flakes

source: Pudding
en: Puddings

source: Speiseeis
en: Edible ices

source: Eiscreme
en: Ice cream

source: Nicht medizinische Kräutertees
en: Infusions, not medicinal

source: Nudeln
en: Noodles

source: Curry [Gewürz]
en: Curry [spice]

source: Currypulver [Gewürz]
en: Curry powder [spice]

source: Ketchup [Soße]
en: Ketchup [sauce]

source: Geschälte Gerste
en: Husked barley

source: Kuchen
en: Cakes

source: Wareniki [gefüllte Teigtaschen]
en: Vareniki [stuffed dumplings]

source: Pelmeni [Teigtaschen mit Fleischfüllung]
en: Pelmeni [dumplings stuffed with meat]

source: Verarbeitete Quinoa
en: Processed quinoa

source: Verarbeitete Hirse
en: Processed sorghum

source: Streuzucker
en: Castor sugar

source: Dragierte Pinienkerne
en: Sugar coated pine nuts

source: Frittierte Teigzöpfe
en: Fried dough twists

source: Geröstete natürliche Holzteilchen als Aromatisierungszusatz für Weine
en: Toasted natural wood chips added to wine to improve its flavour

source: Verarbeiteter Knoblauch als Würzmittel
en: Processed garlic for use as seasoning

source: Mandelaromen für Nahrungsmittel oder Getränke
en: Flavourings of almond for food or beverages

source: Kokosnussmehl für den menschlichen Verzehr
en: Coconut meal for human consumption

source: Bayrische Crème
en: Bavarian creams

source: Crèmes brûlées
en: Crème brûlées

source: Fertiggerichte auf Reisbasis
en: Rice-based prepared meals

source: Frittierte Teigkekse
en: Fried dough cookies

source: Gefrorener Brownie-Teig
en: Frozen brownie dough

source: Teinfreier Tee
en: Theine-free tea

source: Melassesirup für Kochzwecke
en: Molasses syrup for culinary purposes

source: Stärkesirup für Kochzwecke
en: Starch syrup for culinary purposes

source: Maissirup für Kochzwecke
en: Corn syrup for culinary purposes

source: Kerbel, eingemacht
en: Preserved chervil

source: Weißer Tee
en: White tea

source: Gefüllte Schokoladenriegel
en: Filled chocolate bars

source: Puffkäsebällchen [Maissnacks]
en: Puffed cheese balls [corn snacks]

source: Atemerfrischender Kaugummi
en: Breath-freshening chewing gum

source: Chilipasten zur Verwendung als Gewürz
en: Chili paste for use as a seasoning

source: Fruchtaromen, andere als ätherische Öle
en: Fruit flavorings, other than essential oils

source: Verpacktes Essen bestehend aus Reis mit Fleisch, Fisch oder Gemüse
en: Boxed lunches consisting of rice, with added meat, fish or vegetables

source: Schokoladen-Brotaufstriche mit Nüssen
en: Chocolate spreads containing nuts

source: Minzpastillen zur Atemerfrischung
en: Breath mints for use as a breath freshener

source: Chow Mein [Nudelgerichte]
en: Chow mein [noodle-based dishes]

source: Sopapillas [Fettgebackenes]
en: Sopapillas [fried pastries]

source: Salbei [Gewürz]
en: Sage [seasoning]

source: Zutaten auf Kakaobasis für Confiserieprodukte
en: Cocoa-based ingredients for confectionery products

source: Zitronenaromen andere als ätherische Öle
en: Lemon flavorings, other than essential oils

source: Mandelgeschmacksstoffe, andere als ätherische Öle
en: Almond flavorings, other than essential oils

source: Gefrorene Joghurtkuchen
en: Frozen yogurt cakes

source: Baozi [gefüllte Brötchen]
en: Baozi [stuffed buns]

source: Reispaste für Speisezwecke
en: Rice pulp for culinary purposes

source: Jiaozi [gefüllte Teigtaschen]
en: Jiaozi [stuffed dumplings]

source: Ramen [Nudelgericht japanischer Art]
en: Ramen [Japanese noodle-based dish]

source: Teigmischungen für Okonomiyaki [pikante Pfannkuchen japanischer Art]
en: Batter mixes for okonomiyaki [Japanese savoury pancakes]

source: Essbares Reispapier
en: Edible rice paper

source: Geröstetes Getreidemehl
en: Toasted grain flour

source: Vegane Mayonnaise
en: Vegan mayonnaise

source: Rasur-Eis mit gesüßten roten Bohnen
en: Shaved ices with sweetened red beans

source: Präparate für die Zubereitung von Zuckerwaren
en: Preparations for making of sugar confectionery

source: Brot mit süßen roten Bohnen
en: Bread with sweet red bean

source: Gefrorener Cantuccini-Teig
en: Frozen biscotti dough

source: Essbare Eisskulpturen
en: Edible ice sculptures

source: Gewürze
en: Spices

source: Gebratene Nudeln
en: Fried noodles

source: Sirup und Melasse
en: Syrups and treacles

source: Getränke auf der Basis von Kaffeeersatz
en: Beverages based on coffee substitutes

source: Softeis
en: Soft ices

source: Chilipasten als Würzmittel
en: Chili pepper paste being condiment

source: Gedämpfte Biskuitkuchen [Fa Gao]
en: Steamed sponge cakes (fagao)

source: Mayonnaise- und Ketchupaufstriche
en: Mayonnaise and ketchup-based spreads

source: Milchfreie Schokolade
en: Dairy-free chocolate

source: Brötchen aus Maismehl [Almojábana]
en: Cornflour bun bread (almojábana)

source: Lebensmittelaromen, ausgenommen ätherische Öle
en: Food flavorings, other than essential oils

source: Schokolade, dargeboten in einem Adventskalender
en: Chocolates presented in an advent calendar

source: Mohn zur Verwendung als Würzmittel
en: Poppy seeds for use as a seasoning

source: Backwaren mit Mohn
en: Poppy seed pastry

source: Sichuan-Pfeffer als Würzmittel
en: Sichuan peppers being condiments

source: Oligosaccharide für Speisezwecke
en: Oligosaccharides for culinary purposes

source: Gewürzte Paniermehlmischung zum Frittieren
en: Seasoned breading mix for deep frying

source: Natürliche kalorienarme Süßungsmittel
en: Natural low calorie sweeteners

source: Gerste zur Verwendung als Kaffeeersatz
en: Barley for use as a coffee substitute

source: Mineralsalze für Rinder
en: Mineral salts for cattle

source: Streumaterialien für Tiere
en: Bedding materials for animals

source: Schlachtvieh
en: Beef cattle

source: Kleie
en: Bran

source: Frische Küchenkräuter
en: Garden herbs, fresh

source: Lebende Krabben
en: Crabs [live]

source: Wurzeln als Tierfutter
en: Roots for animal consumption

source: Unverarbeitete Tomaten
en: Unprocessed tomatoes

source: Unverarbeitetes Gemüse
en: Unprocessed vegetables

source: Getränke für Hunde
en: Beverages for canines

source: In faserhaltigen Vermehrungssubstratmatten ausgesäte Samen zur Begrünung von Feldern
en: Seeds pre-sown in matted fibrous propagation media for grassing fields

source: Torfeinstreu für Tiere
en: Peat litter for animals

source: Frische Oliven
en: Olives, fresh

source: Rohe Meerrettichwurzeln
en: Raw horseradish root

source: Futter für Nagetiere
en: Food for rodents

source: Zimmerpflanzen
en: House plants

source: Haferpräparate für Futterzwecke
en: Processed oats for consumption by animals

source: Frische Artischocken
en: Fresh artichokes

source: Frische Zitrusfrüchte
en: Citrus fruit, fresh

source: Tannenzapfen
en: Pine cones

source: Frische Zucchini
en: Fresh zucchini

source: Futtermittel für Tiere auf Milchbasis
en: Foodstuffs for animals on a milk basis

source: Frische Trüffel
en: Truffles, fresh

source: Frische Blumendekorationen
en: Floral decorations [fresh]

source: Natürliche Blumendekorationen
en: Floral decorations [natural]

source: Lebende Gliederfüßer zur Schädlingsbekämpfung
en: Live arthropods for the control of pests

source: Frische Beeren
en: Berries, fresh

source: Piment [Pflanze]
en: Peppers [plants]

source: Frische Wassermelonen
en: Watermelon, fresh

source: Essbare Nüsse [unverarbeitet]
en: Edible nuts [unprocessed]

source: Schlempe [Rückstand bei der Weinbereitung]
en: Residue in a still after distillation

source: Frische Erdnüsse
en: Peanuts, fresh

source: Unverarbeitete Kirschen
en: Cherries (Unprocessed -)

source: Futter für Kälber
en: Foodstuffs for calves

source: Frisches Mischobst
en: Mixed fruits [fresh]

source: Lebende Pflanzen
en: Natural plants

source: Frisches Obst
en: Fruit, fresh

source: Getränke für Haustiere
en: Beverages for pets

source: Kokons zur Eierproduktion
en: Cocoons for egg production

source: Unverarbeitete Quitten
en: Unprocessed quince

source: Aloe Vera-Pflanzen
en: Aloe vera plants

source: Frischer Spinat
en: Spinach, fresh

source: Weizenkeime als Tierfutter
en: Wheat germ for animal consumption

source: Unverarbeitete Bohnen
en: Unprocessed beans

source: Perlgraupen [in der Schale]
en: Pearl barley [in the husk]

source: Dosenfutter mit Fleischanteilen für Jungtiere
en: Canned foodstuffs consisting of meat for young animals

source: Futter für Meerestiere
en: Foodstuffs for marine animals

source: Futter für Mutterschafe
en: Foodstuffs for sheep

source: Rinde als Tiereinstreumittel
en: Bark for use as animal litter

source: Produkte auf Rindenbasis zur Verwendung als Tierstreu
en: Bark-based products for use as animal litter

source: Treber [Trester]
en: Rice, unprocessed

source: Unbehandelter Reis
en: Unprocessed garlic

source: Unverarbeiteter Knoblauch
en: Unprocessed mushrooms

source: Unverarbeitete Pilze
en: Unprocessed nuts

source: Unverarbeitete Nüsse
en: Malt for animals

source: Lebende Pflanzen für Aquarien
en: Preserved crops for animal feeds

source: Konservierte Feldfrüchte als Tierfutter
en: Foods flavoured with liver for feeding dogs

source: Treber [Fruchtrückstände]
en: Fruit residue [marc]

source: Lebende Wassertiere
en: Live aquatic creatures

source: Lebende Pflanzen mit symbiotischen Mikroorganismen
en: Live plants with symbiotic microorganisms

source: Algen zur tierischen Ernährung
en: Algae for animal consumption

source: Salinenkrebse als Fischfutter
en: Brine shrimp for fish food

source: Mais
en: Maize

source: Futterstroh
en: Straw [forage]

source: Frisches Salatgemüse
en: Salad vegetables [fresh]

source: Pikantes Gebäck für Tiere
en: Savory biscuits for animals

source: Futter für Goldfische
en: Food for goldfish

source: Rindfleisch enthaltendes Katzenfutter
en: Foods containing beef for feeding cats

source: Farne
en: Ferns

source: Frische Quitten
en: Fresh quince

source: Blumenzwiebeln für landwirtschaftliche Zwecke
en: Bulbs (Plant -) for agricultural use

source: Frische Maronen
en: Chestnuts, fresh

source: Hafer
en: Oats

source: Biologisch abbaubare Mulchplatten aus Holzfasern
en: Biodegradable mulching plates made of wood fibres

source: Holzspäne als Einstreu für Tiere
en: Woodshavings for use as animal bedding

source: Hefe als Futtermittel
en: Yeast for animal fodder

source: Hefetabletten für Futterzwecke
en: Yeast tablets for consumption by animals

source: Archemuscheln, lebend
en: Ark-shells [live]

source: Unverarbeitete Zucchini
en: Unprocessed zucchini

source: Vogelfutter
en: Bird food

source: Frisches Gemüse
en: Vegetables, fresh

source: Futtermittel mit luftgetrocknetem Heu
en: Animal foodstuffs containing air-cured hay

source: Leinsamen als Tierfutter
en: Linseed for animal consumption

source: Leinsamenmehl als Tierfutter
en: Linseed meal for animal consumption

source: Sojasaucenkuchen [Futtermittel]
en: Soy sauce cakes [animal feed]

source: Paprika
en: Capsicums

source: Tierfutter auf Getreidebasis
en: Cereal based foodstuffs for animals

source: Getreidekuchen für Tiere
en: Cereal cakes for animals

source: Frische Äpfel
en: Fresh apples

source: Frischer Spargel
en: Fresh asparagus

source: Einstreu für Geflügel
en: Bedding material for fowl

source: Frische Tomaten
en: Fresh tomatoes

source: Unverarbeitete Kokosnüsse
en: Unprocessed coconuts

source: Milchpulver für Welpen
en: Powdered milk for puppies

source: Katzenfutter mit Hühnchengeschmack
en: Foods flavoured with chicken for feeding cats

source: Dekorativer Holzschnitzelmulch
en: Decorative woodchip mulch

source: Gerste
en: Barley

source: Frische Linsen
en: Lentils, fresh

source: Blühende Pflanzen
en: Flowering plants

source: Gefällte Christbäume
en: Cut Christmas trees
